# Introduction to Pandas Lab

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

### 1. Import Numpy and Pandas and alias them to `np` and `pd` respectively.

In [25]:
import pandas as pd
import numpy as np

### 2. Create a Pandas Series containing the elements of the list below.

In [26]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [27]:
# your code here
pandas_series = pd.Series(lst)

### 3. Use indexing to return the third value in the Series above.

*Hint: Remember that indexing begins at 0.*

In [28]:
# your code 
pandas_series[2]

74.4

### 4. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

In [29]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [30]:
# your code here
df_b = pd.DataFrame(b)
print(df_b)

      0     1     2     3     4
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4   0.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9
5  49.0  69.0   0.1  31.8  89.1
6  23.3  40.7  95.0  83.8  26.9
7  27.6  26.4  53.8  88.8  68.5
8  96.6  96.4  53.4  72.4  50.1
9  73.7  39.0  43.2  81.6  34.7

### 5. Rename the data frame columns based on the names in the list below.

In [31]:
list_b = ["A", "B", "C", "D", "E"]
#There was a typo in this exercice

In [32]:
# your code here
df_b.columns = list_b
df_b

      A     B     C     D     E
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4   0.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9
5  49.0  69.0   0.1  31.8  89.1
6  23.3  40.7  95.0  83.8  26.9
7  27.6  26.4  53.8  88.8  68.5
8  96.6  96.4  53.4  72.4  50.1
9  73.7  39.0  43.2  81.6  34.7

### 6. Create a subset of this data frame that contains only the Score 1, 3, and 5 columns.

In [33]:
# your code here
subset_df = df_b[["A", "C", "E"]]
subset_df

      A     C     E
0  53.1  67.5  78.4
1  61.3  30.8  87.6
2  20.6  44.2  91.8
3  57.4  96.1  69.5
4  83.6  85.4  35.9
5  49.0   0.1  89.1
6  23.3  95.0  26.9
7  27.6  53.8  68.5
8  96.6  53.4  50.1
9  73.7  43.2  34.7

### 7. From the original data frame, calculate the average Score_3 value.

In [34]:
# your code here
df_b["C"].mean()

56.95000000000001

### 8. From the original data frame, calculate the maximum Score_4 value.

In [35]:
# your code here
df_b["D"].max()

88.8

### 9. From the original data frame, calculate the median Score 2 value.

In [36]:
# your code here
df_b["B"].median()

40.75

### 10. Create a Pandas DataFrame from the dictionary of product orders below.

In [37]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [38]:
# your code here
df_dic = pd.DataFrame(orders)
df_dic

                          Description  Quantity  UnitPrice  Revenue
0              LUNCH BAG APPLE DESIGN         1       1.65     1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24       0.55    13.20
2         RIBBON REEL STRIPES DESIGN          1       1.65     1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS      2880       0.18   518.40
4    PLAYING CARDS JUBILEE UNION JACK         2       1.25     2.50
5                      POPCORN HOLDER         7       0.85     5.95
6      BOX OF VINTAGE ALPHABET BLOCKS         1      11.95    11.95
7                       PARTY BUNTING         4       4.95    19.80
8            JAZZ HEARTS ADDRESS BOOK        10       0.19     1.90
9       SET OF 4 SANTA PLACE SETTINGS        48       1.25    60.00

### 11. Calculate the total quantity ordered and revenue generated from these orders.

In [51]:
# your code here
df_11 = df_dic[['Quantity', 'Revenue']]
df_11[['Quantity', 'Revenue']].sum()

Quantity    2978.0
Revenue      637.0
dtype: float64

### 12. Obtain the prices of the most expensive and least expensive items ordered and print the difference.

In [55]:
# Find the most and least expensive items
max_price = df_dic['UnitPrice'].max()
min_price = df_dic['UnitPrice'].min()

# Print the most and least expensive items
most_expensive = df_dic[df_dic['UnitPrice'] == max_price]
least_expensive = df_dic[df_dic['UnitPrice'] == min_price]

print("Most expensive item(s):")
print(most_expensive)
print("\nLeast expensive item(s):")
print(least_expensive)
print("\nDifference between most and least expensive items:", max_price - min_price)

Most expensive item(s):
                      Description  Quantity  UnitPrice  Revenue
6  BOX OF VINTAGE ALPHABET BLOCKS         1      11.95    11.95

Least expensive item(s):
                         Description  Quantity  UnitPrice  Revenue
3  WORLD WAR 2 GLIDERS ASSTD DESIGNS      2880       0.18    518.4

Difference between most and least expensive items: 11.77

## Let's load another dataset for more exercisesº

In [63]:
# Run this code:
admissions = pd.read_csv('../Admission_Predict.csv')

Let's evaluate the dataset by looking at the `head` function.

In [64]:
# your code here
admissions.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,316,104,3,3.0,3.5,8.00,1,0.72
2,3,322,110,3,3.5,2.5,8.67,1,0.80
3,4,314,103,2,2.0,3.0,8.21,0,0.65
4,5,330,115,5,4.5,3.0,9.34,1,0.90

### 1 - Before beginning to work with this dataset and evaluating graduate admissions data, we will verify that there is no missing data in the dataset. Do this in the cell below.

In [58]:
# your code here
missing = admissions.isnull()
missing

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...
380,False,False,False,False,False,False,False,False,False
381,False,False,False,False,False,False,False,False,False
382,False,False,False,False,False,False,False,False,False
383,False,False,False,False,False,False,False,False,False
384,False,False,False,False,False,False,False,False,False

###  2 -  Interestingly, there is a column that uniquely identifies the applicants. This column is the serial number column. Instead of having our own index, we should make this column our index. Do this in the cell below. Keep the column in the dataframe in addition to making it an index.

In [67]:
# your code here
admissions = pd.read_csv('../Admission_Predict.csv')
admissions.set_index('Serial No.', inplace=True, drop=False)
admissions.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,,
1,1,337,118,4,4.5,4.5,9.65,1,0.92
2,2,316,104,3,3.0,3.5,8.00,1,0.72
3,3,322,110,3,3.5,2.5,8.67,1,0.80
4,4,314,103,2,2.0,3.0,8.21,0,0.65
5,5,330,115,5,4.5,3.0,9.34,1,0.90

Turns out that `GRE Score` and `CGPA` also uniquely identify the data. Show this in the cell below.

In [68]:
"""To demonstrate that the GRE Score and CGPA columns together uniquely identify the data in your DataFrame, you can check if these columns form a unique combination for each row."""
grouped = admissions.groupby(['GRE Score', 'CGPA'])
group_sizes = grouped.size()
unique_combinations = group_sizes[group_sizes > 1]
if unique_combinations.empty:
    print("Each combination of 'GRE Score' and 'CGPA' is unique.")
else:
    print("There are combinations of 'GRE Score' and 'CGPA' that are not unique:")
    print(unique_combinations)

Each combination of 'GRE Score' and 'CGPA' is unique.

### 3 - In this part of the lab, we would like to test complex conditions on the entire data set at once. Let's start by finding the number of rows where the CGPA is greater than 9 and the student has performed an investigation.

In [69]:
# your code here
nine_cgpa = admissions[admissions['CGPA'] > 9]
print(nine_cgpa)

            Serial No.  GRE Score  TOEFL Score  University Rating  SOP  LOR   \
Serial No.
1                    1        337          118                  4  4.5   4.5
5                    5        330          115                  5  4.5   3.0
11                  11        328          112                  4  4.0   4.5
20                  20        328          116                  5  5.0   5.0
21                  21        334          119                  5  5.0   4.5
...                ...        ...          ...                ...  ...   ...
380                380        329          111                  4  4.5   4.0
381                381        324          110                  3  3.5   3.5
382                382        325          107                  3  3.0   3.5
383                383        330          116                  4  5.0   4.5
385                385        333          117                  4  5.0   4.0

            CGPA  Research  Chance of Admit
Serial No.
1           9.65         1              0.92
5           9.34         1              0.90
11          9.10         1              0.78
20          9.50         1              0.94
21          9.70         1              0.95
...          ...       ...               ...
380         9.23         1              0.89
381         9.04         1              0.82
382         9.11         1              0.84
383         9.45         1              0.91
385         9.66         1              0.95

[110 rows x 9 columns]

### 4 - Now return all the rows where the CGPA is greater than 9 and the SOP score is less than 3.5. Find the mean chance of admit for these applicants.

In [78]:
# your code here
# Assuming df is your DataFrame and it has columns: 'CGPA', 'SOP Score', and 'Chance of Admit'

# Example: Filter applicants with specific CGPA and SOP Score
filtered_applicants = admissions[(admissions['CGPA'] >= 9) & (admissions['SOP'] <= 3.5)]
print(filtered_applicants)

# Calculate the mean chance of admit for these applicants
admissions['Mean Chance'] = filtered_applicants[['CGPA', 'SOP']].mean(axis=1)
print(admissions)
print("Mean chance of admit:", admissions['Mean Chance'])

            Serial No.  GRE Score  TOEFL Score  University Rating  SOP  LOR   \
Serial No.
29                  29        338          118                  4  3.0   4.5
63                  63        327          114                  3  3.0   3.0
65                  65        318          109                  3  3.5   4.0
100                100        326          112                  3  3.5   3.0
103                103        338          117                  4  3.5   4.5
124                124        326          112                  3  3.5   3.0
133                133        318          109                  1  3.5   3.5
141                141        326          114                  3  3.0   3.0
171                171        319          110                  3  3.5   3.5
218                218        324          111                  4  3.0   3.0
232                232        325          114                  3  3.5   3.0
240                240        316           99                  2  2.5   3.0
312                312        326          116                  3  3.5   4.0
357                357        324          110                  3  3.5   3.0
381                381        324          110                  3  3.5   3.5
382                382        325          107                  3  3.0   3.5

            CGPA  Research  Chance of Admit
Serial No.
29          9.40         1              0.91
63          9.02         0              0.61
65          9.22         1              0.68
100         9.05         1              0.74
103         9.46         1              0.91
124         9.10         1              0.84
133         9.12         0              0.78
141         9.11         1              0.83
171         9.04         0              0.82
218         9.01         1              0.82
232         9.04         1              0.76
240         9.00         0              0.70
312         9.14         1              0.81
357         9.22         1              0.89
381         9.04         1              0.82
382         9.11         1              0.84
            Serial No.  GRE Score  TOEFL Score  University Rating  SOP  LOR   \
Serial No.
1                    1        337          118                  4  4.5   4.5
2                    2        316          104                  3  3.0   3.5
3                    3        322          110                  3  3.5   2.5
4                    4        314          103                  2  2.0   3.0
5                    5        330          115                  5  4.5   3.0
...                ...        ...          ...                ...  ...   ...
381                381        324          110                  3  3.5   3.5
382                382        325          107                  3  3.0   3.5
383                383        330          116                  4  5.0   4.5
384                384        312          103                  3  3.5   4.0
385                385        333          117                  4  5.0   4.0

            CGPA  Research  Chance of Admit   Mean Chance
Serial No.
1           9.65         1              0.92          NaN
2           8.00         1              0.72          NaN
3           8.67         1              0.80          NaN
4           8.21         0              0.65          NaN
5           9.34         1              0.90          NaN
...          ...       ...               ...          ...
381         9.04         1              0.82        6.270
382         9.11         1              0.84        6.055
383         9.45         1              0.91          NaN
384         8.78         0              0.67          NaN
385         9.66         1              0.95          NaN

[385 rows x 10 columns]
Mean chance of admit: Serial No.
1        NaN
2        NaN
3        NaN
4        NaN
5        NaN
       ...
381    6.270
382    6.055
383      NaN
384      NaN
385      NaN
Name: Mean Chance, Length: 385, dtype: float64